wssi-fe-3.1/tutorials/2D-wave-soil/wave/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (  0 -3 0 )
    ( 36 -3 0 )
    (  0  1 0 )
    ( 36  1 0 )
                 
    (  0 -3   0.1 )
    ( 36 -3 0.1 )
    (  0  1 0.1 )
    ( 36  1 0.1 )                    
);

blocks          
(
    hex (0 1 3 2 4 5 7 6) ( 600 300 1 ) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
    patch inlet
    (
        (0 4 6 2)
    )
    wall bottom 
    (
        (0 1 5 4)
    )
    patch outlet
    (
        (1 5 7 3)
    )

    patch atmosphere 
    (
        (2 3 7 6)
    )
    
    empty frontBack
    (
        (0 1 3 2)
        (4 5 7 6)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
