wssi-fe-3.1/tutorials/2D-wave-soil/wave/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          300;
        startFace       359100;
    }
    bottom
    {
        type            wall;
        nFaces          600;
        startFace       359400;
    }
    outlet
    {
        type            patch;
        nFaces          300;
        startFace       360000;
    }
    atmosphere
    {
        type            patch;
        nFaces          600;
        startFace       360300;
    }
    frontBack
    {
        type            empty;
        nFaces          360000;
        startFace       360900;
    }
)

// ************************************************************************* //
