wssi-fe-3.1/tutorials/2D-wave-soil/wave/constant/waveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format	ascii;
    class	dictionary;
    object	waveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

seaLevel            0;

relaxationNames     ( inlet outlet );

initializationName  outlet;

inletCoeffs
{
    waveType            stokesFifth;
    height              0.5;
    period              2;
    depth               3;
    stokesDrift         0;
    direction           ( 1 0 0 );
    Tsoft               2;
    phi                 0;
    waveNumber          (0.971821 0 0);
    omega               3.14159;

    relaxationZone
    {
        relaxationScheme    Spatial;
        relaxationShape     Rectangular;
        beachType           Empty;
        relaxType           INLET;
        startX              ( 0 0 -1 );
        endX                ( 6 0 1 );
        orientation         ( 1 0 0 );
    }
}

outletCoeffs
{
    waveType            potentialCurrent;
    U                   ( 0 0 0 );
    Tsoft               2;

    relaxationZone
    {
        relaxationScheme    Spatial;
        relaxationShape     Rectangular;
        beachType           Empty;
        relaxType           OUTLET;
        startX              ( 30 0 -1 );
        endX                ( 36 0 1 );
        orientation         ( 1 0 0 );
    }
}



// ************************************************************************* //
